MikroElektronika/core_packages/PIC/XC8/def/PIC18LF26K42/mcu.h
extern volatile INLVLEbits_t INLVLEbits __at(0x3A84);
// bitfield macros
#define _INLVLE_INLVLE3_POSN                                0x3
#define _INLVLE_INLVLE3_POSITION                            0x3
#define _INLVLE_INLVLE3_SIZE                                0x1
#define _INLVLE_INLVLE3_LENGTH                              0x1
#define _INLVLE_INLVLE3_MASK                                0x8

// Register: IOCEP
#define IOCEP IOCEP
extern volatile unsigned char           IOCEP               __at(0x3A85);
#ifndef _LIB_BUILD
asm("IOCEP equ 03A85h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEP3                 :1;
    };
} IOCEPbits_t;
extern volatile IOCEPbits_t IOCEPbits __at(0x3A85);
// bitfield macros
#define _IOCEP_IOCEP3_POSN                                  0x3
#define _IOCEP_IOCEP3_POSITION                              0x3
#define _IOCEP_IOCEP3_SIZE                                  0x1
#define _IOCEP_IOCEP3_LENGTH                                0x1
#define _IOCEP_IOCEP3_MASK                                  0x8

// Register: IOCEN
#define IOCEN IOCEN
extern volatile unsigned char           IOCEN               __at(0x3A86);
#ifndef _LIB_BUILD
asm("IOCEN equ 03A86h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEN3                 :1;
    };
} IOCENbits_t;
extern volatile IOCENbits_t IOCENbits __at(0x3A86);
// bitfield macros
#define _IOCEN_IOCEN3_POSN                                  0x3
#define _IOCEN_IOCEN3_POSITION                              0x3
#define _IOCEN_IOCEN3_SIZE                                  0x1
#define _IOCEN_IOCEN3_LENGTH                                0x1
#define _IOCEN_IOCEN3_MASK                                  0x8

// Register: IOCEF
#define IOCEF IOCEF
extern volatile unsigned char           IOCEF               __at(0x3A87);
#ifndef _LIB_BUILD
asm("IOCEF equ 03A87h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEF3                 :1;
    };
} IOCEFbits_t;
extern volatile IOCEFbits_t IOCEFbits __at(0x3A87);
// bitfield macros
#define _IOCEF_IOCEF3_POSN                                  0x3
#define _IOCEF_IOCEF3_POSITION                              0x3
#define _IOCEF_IOCEF3_SIZE                                  0x1
#define _IOCEF_IOCEF3_LENGTH                                0x1
#define _IOCEF_IOCEF3_MASK                                  0x8

// Register: CCDCON
#define CCDCON CCDCON
extern volatile unsigned char           CCDCON              __at(0x3ABE);
#ifndef _LIB_BUILD
asm("CCDCON equ 03ABEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DS                     :2;
        unsigned                        :5;
        unsigned EN                     :1;
    };
    struct {
        unsigned CCDS                   :2;
        unsigned                        :5;
        unsigned CCDEN                  :1;
    };
    struct {
        unsigned SEL0                   :1;
        unsigned SEL1                   :1;
    };
} CCDCONbits_t;
extern volatile CCDCONbits_t CCDCONbits __at(0x3ABE);
// bitfield macros
#define _CCDCON_DS_POSN                                     0x0
#define _CCDCON_DS_POSITION                                 0x0
#define _CCDCON_DS_SIZE                                     0x2
#define _CCDCON_DS_LENGTH                                   0x2
#define _CCDCON_DS_MASK                                     0x3
#define _CCDCON_EN_POSN                                     0x7
#define _CCDCON_EN_POSITION                                 0x7
#define _CCDCON_EN_SIZE                                     0x1
#define _CCDCON_EN_LENGTH                                   0x1
#define _CCDCON_EN_MASK                                     0x80
#define _CCDCON_CCDS_POSN                                   0x0
#define _CCDCON_CCDS_POSITION                               0x0
#define _CCDCON_CCDS_SIZE                                   0x2
#define _CCDCON_CCDS_LENGTH                                 0x2
#define _CCDCON_CCDS_MASK                                   0x3
#define _CCDCON_CCDEN_POSN                                  0x7
#define _CCDCON_CCDEN_POSITION                              0x7
#define _CCDCON_CCDEN_SIZE                                  0x1
#define _CCDCON_CCDEN_LENGTH                                0x1
#define _CCDCON_CCDEN_MASK                                  0x80
#define _CCDCON_SEL0_POSN                                   0x0
#define _CCDCON_SEL0_POSITION                               0x0
#define _CCDCON_SEL0_SIZE                                   0x1
#define _CCDCON_SEL0_LENGTH                                 0x1
#define _CCDCON_SEL0_MASK                                   0x1
#define _CCDCON_SEL1_POSN                                   0x1
#define _CCDCON_SEL1_POSITION                               0x1
#define _CCDCON_SEL1_SIZE                                   0x1
#define _CCDCON_SEL1_LENGTH                                 0x1
#define _CCDCON_SEL1_MASK                                   0x2

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
extern volatile unsigned char           PPSLOCK             __at(0x3ABF);
#ifndef _LIB_BUILD
asm("PPSLOCK equ 03ABFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PPSLOCKED              :1;
    };
} PPSLOCKbits_t;
extern volatile PPSLOCKbits_t PPSLOCKbits __at(0x3ABF);
// bitfield macros
#define _PPSLOCK_PPSLOCKED_POSN                             0x0
#define _PPSLOCK_PPSLOCKED_POSITION                         0x0
#define _PPSLOCK_PPSLOCKED_SIZE                             0x1
#define _PPSLOCK_PPSLOCKED_LENGTH                           0x1
#define _PPSLOCK_PPSLOCKED_MASK                             0x1

// Register: INT0PPS
#define INT0PPS INT0PPS
extern volatile unsigned char           INT0PPS             __at(0x3AC0);
#ifndef _LIB_BUILD
asm("INT0PPS equ 03AC0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0PPS                :5;
    };
} INT0PPSbits_t;
extern volatile INT0PPSbits_t INT0PPSbits __at(0x3AC0);
// bitfield macros
#define _INT0PPS_INT0PPS_POSN                               0x0
#define _INT0PPS_INT0PPS_POSITION                           0x0
#define _INT0PPS_INT0PPS_SIZE                               0x5
#define _INT0PPS_INT0PPS_LENGTH                             0x5
#define _INT0PPS_INT0PPS_MASK                               0x1F

// Register: INT1PPS
#define INT1PPS INT1PPS
extern volatile unsigned char           INT1PPS             __at(0x3AC1);
#ifndef _LIB_BUILD
asm("INT1PPS equ 03AC1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT1PPS                :5;
    };
} INT1PPSbits_t;
extern volatile INT1PPSbits_t INT1PPSbits __at(0x3AC1);
// bitfield macros
#define _INT1PPS_INT1PPS_POSN                               0x0
#define _INT1PPS_INT1PPS_POSITION                           0x0
#define _INT1PPS_INT1PPS_SIZE                               0x5
#define _INT1PPS_INT1PPS_LENGTH                             0x5
#define _INT1PPS_INT1PPS_MASK                               0x1F

// Register: INT2PPS
#define INT2PPS INT2PPS
extern volatile unsigned char           INT2PPS             __at(0x3AC2);
#ifndef _LIB_BUILD
asm("INT2PPS equ 03AC2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT2PPS                :5;
    };
} INT2PPSbits_t;
extern volatile INT2PPSbits_t INT2PPSbits __at(0x3AC2);
// bitfield macros
#define _INT2PPS_INT2PPS_POSN                               0x0
#define _INT2PPS_INT2PPS_POSITION                           0x0
#define _INT2PPS_INT2PPS_SIZE                               0x5
#define _INT2PPS_INT2PPS_LENGTH                             0x5
#define _INT2PPS_INT2PPS_MASK                               0x1F

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
extern volatile unsigned char           T0CKIPPS            __at(0x3AC3);
#ifndef _LIB_BUILD
asm("T0CKIPPS equ 03AC3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T0CKIPPS               :5;
    };
} T0CKIPPSbits_t;
extern volatile T0CKIPPSbits_t T0CKIPPSbits __at(0x3AC3);
// bitfield macros
#define _T0CKIPPS_T0CKIPPS_POSN                             0x0
#define _T0CKIPPS_T0CKIPPS_POSITION                         0x0
#define _T0CKIPPS_T0CKIPPS_SIZE                             0x5
#define _T0CKIPPS_T0CKIPPS_LENGTH                           0x5
#define _T0CKIPPS_T0CKIPPS_MASK                             0x1F

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
extern volatile unsigned char           T1CKIPPS            __at(0x3AC4);
#ifndef _LIB_BUILD
asm("T1CKIPPS equ 03AC4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T1CKIPPS               :5;
    };
} T1CKIPPSbits_t;
extern volatile T1CKIPPSbits_t T1CKIPPSbits __at(0x3AC4);
// bitfield macros
#define _T1CKIPPS_T1CKIPPS_POSN                             0x0
#define _T1CKIPPS_T1CKIPPS_POSITION                         0x0
#define _T1CKIPPS_T1CKIPPS_SIZE                             0x5
#define _T1CKIPPS_T1CKIPPS_LENGTH                           0x5
#define _T1CKIPPS_T1CKIPPS_MASK                             0x1F

// Register: T1GPPS
#define T1GPPS T1GPPS
extern volatile unsigned char           T1GPPS              __at(0x3AC5);
#ifndef _LIB_BUILD
asm("T1GPPS equ 03AC5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T1GPPS                 :5;
    };
} T1GPPSbits_t;
extern volatile T1GPPSbits_t T1GPPSbits __at(0x3AC5);
// bitfield macros
#define _T1GPPS_T1GPPS_POSN                                 0x0
#define _T1GPPS_T1GPPS_POSITION                             0x0
#define _T1GPPS_T1GPPS_SIZE                                 0x5
#define _T1GPPS_T1GPPS_LENGTH                               0x5
#define _T1GPPS_T1GPPS_MASK                                 0x1F

